_site/boj-9205/index.html
<div id="outline-container-orgc969017" class="outline-2">
<h2 id="orgc969017">BOJ 9205 맥주 마시면서 걸어가기</h2>
<div class="outline-text-2" id="text-orgc969017">
<ul class="org-ul">
<li>출발지점, 중간지점여러개, 도착지점을 갈 때, 각 점마다 1000이하의 비용만 이동가능</li>
<li>도착 가능한지 출력</li>
</ul>
</div>
</div>

<div id="outline-container-org71d35b8" class="outline-2">
<h2 id="org71d35b8">접근하기</h2>
<div class="outline-text-2" id="text-org71d35b8">
<pre class="example">
1. 집 -&gt; 편의점1 -&gt; 편의점2 -&gt; ... -&gt; 편의점N -&gt; 목적지

2. 편의점 개수가 100개이므로, O(N^2)으로 순서대로 연결함 (distance가 1000이하인 경우)
   -&gt; 인접 list를 구성함

3. dfs(0)하고 visit[N-1]이 true이면 목적지에 도착한 것임
</pre>
</div>
</div>


<div id="outline-container-orgba95e0f" class="outline-2">
<h2 id="orgba95e0f">코드 - dfs로 풀이</h2>
<div class="outline-text-2" id="text-orgba95e0f">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">pair</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #8ae234; font-weight: bold;">Point</span>;

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">ARR_CNT</span> (100+2+10)
<span style="color: #8ae234; font-weight: bold;">Point</span> <span style="color: #ff6347;">a</span>[ARR_CNT];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">vis</span>[ARR_CNT];
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">G</span>[ARR_CNT];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">distance</span>(<span style="color: #8ae234; font-weight: bold;">Point</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Point</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> abs(p1.first - p2.first) + abs(p1.second - p2.second);
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    vis[num] = 1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">next</span>:G[num]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (!vis[next]) {
            dfs(next);
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">solve</span>()
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    N = N + 2;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;=N;i++) {
        vis[i] = 0;
        G[i].clear();
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;a[i].first, &amp;a[i].second);
    }

    <span style="color: #888a85;">// </span><span style="color: #888a85;">graph &#44221;&#47196;&#47484; &#44396;&#49457;</span>
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i+1;j&lt;N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (distance(a[i], a[j]) &lt;= 20*50) {
                G[i].push_back(j);
                G[j].push_back(i);
            }
        }        
    }
    dfs(0); <span style="color: #888a85;">// </span><span style="color: #888a85;">0&#48264;&#51060; &#49345;&#44540;&#51060;&#45348; &#51665;</span>
    <span style="color: #729fcf; font-weight: bold;">if</span> (vis[N-1] == <span style="color: #8ae234;">true</span>)
        printf(<span style="color: #ad7fa8; font-style: italic;">"happy\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">else</span>
        printf(<span style="color: #ad7fa8; font-style: italic;">"sad\n"</span>);    
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;T);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tc</span>=1;tc&lt;=T;tc++) {
        solve();
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgae198dd" class="outline-2">
<h2 id="orgae198dd"><span class="todo TODO">TODO</span> 코드 - 플로이드 와샬</h2>
<div class="outline-text-2" id="text-orgae198dd">
<ul class="org-ul">
<li>구글링 해볼 것</li>
</ul>
</div>
</div>

<div id="outline-container-orgb4ae2f4" class="outline-2">
<h2 id="orgb4ae2f4">문제 링크</h2>
<div class="outline-text-2" id="text-orgb4ae2f4">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/9205">https://www.acmicpc.net/problem/9205</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7917632" class="outline-2">
<h2 id="org7917632">풀이 참고 (아이디어)</h2>
<div class="outline-text-2" id="text-org7917632">
<ul class="org-ul">
<li><a href="https://jaimemin.tistory.com/709">https://jaimemin.tistory.com/709</a></li>
</ul>
</div>
</div>
